import React from 'react';
import Content from './Content';
import "../styles/TariffAgreement.css"



function AverageAgreement( ) {
    return (
        <section className="tariff-agreement average">
            <Content>
                <div className='average-container'>
                    <h2 className='title average-title'>Условия участия в программе Average</h2>
                    <h3 className='subtitle average-subtitle'>Условия хранения токенов UBR на балансе инвесткошелька по программе «Average».
                        <span>Интернет-сервис «Uroboros Platforms» именуемое в дальнейшем "Получатель», с одной стороны, и "Пользователь", с другой стороны, вместе либо по отдельности в тексте настоящих Условий, именуемые "Стороны" либо "Сторона" соответственно, заключили настоящий договор  (далее - "Договор") и приняли полностью данные Условия о нижеследующем:</span>
                    </h3>
                    <ol className='tariff-agreement_items'>
                        <li className='tariff-agreement_item'>ПРЕДМЕТ ДОГОВОРА
                            <ol>
                                <li>Получатель принимает от Пользователя (сумму внутренних токенов UBR (далее - "Баланс") в размере и валюте согласно Договору и Условиям, обязуется возвратить сумму Баланса и выплатить причитающиеся проценты  на условиях и в порядке, предусмотренных Условиями участия.</li>
                            </ol>
                        </li>
                        <li className='tariff-agreement_item'>ПРАВА И ОБЯЗАННОСТИ СТОРОН
                            <ol>
                                <li>Получатель обязуется:
                                    <ol>
                                        <li>Выплатить всю сумму Баланса (часть Баланса) по первому требованию Пользователя после истечения срока действия программы «Average».</li>
                                        <li>Выплачивать Пользователю проценты по Балансу в размере и сроки, предусмотренные Условиями программы «Average.</li>
                                        <li>Предоставлять выписки по счету Баланса по требованию Пользователя. Способ предоставления выписок устанавливается Получателем.</li>
                                        <li>Хранить тайну Баланса в соответствии с действующим законодательством государства Украина.</li>
                                    </ol>
                                </li>
                                <li>Пользователь имеет право:
                                    <ol>
                                        <li>Получить всю сумму Баланса (часть Баланса)  по первому требованию Пользователя после истечения срока действия программы «Average».</li>
                                        <li>Распоряжаться  Балансом как лично, так и через уполномоченных лиц на основании доверенности, оформленной в соответствии с действующим законодательством государства Украина.</li>
                                        <li>Завещать права на получение Баланса и процентов по нему  любому лицу.</li>
                                        <li>Совершать по Балансу расходные и приходные операции в токенах UBR, на условиях и в сроки, установленные настоящими Условиями и действующей программой «Average». Остаток токенов UBR на Балансе (неснижаемый остаток), во время действия программы «Average» после совершения любой расходной операции должен составлять сумму токенов UBR ,равную сумме первоначального пополнения Баланса указанной в п. 6.12. Условий. Настоящим Пользователь предоставляет Получателю право на составление расчетных документов от имени Пользователя (в том числе право на периодическое перечисление процентов дохода в токенах UBR с Баланса Инвесткошелька на Баланс личного кабинета Пользователя) на основании перевода Пользователем в рамках Условий программы «Аverage». </li>
                                        <li>Вносить дополнительные токены UBR на Баланс для открытия аналогичных и иных программ хранения токенов UBR на Балансе. Дополнительное внесение токенов UBR на Баланс инвесткошелька увеличивают сумму Баланса, и к ним применяются все условия настоящего Договора.</li>
                                        <li>Получать выписки о состоянии счета Баланса по первому требованию в соответствии с порядком, установленным Получателем.</li>
                                    </ol>
                                </li>
                                <li>Пользователь  обязуется:
                                    <ol>
                                        <li>Предоставлять Получателю для открытия Баланса и осуществления операций по счету Баланса документы, предусмотренные Пользовательским соглашением «Uroboros Platforms»(Получателем).</li>
                                        <li>Не осуществлять по счету Баланса операции, связанных с мошенническими действиями и легализацией денежных средств добытых преступным путем.</li>
                                    </ol>
                                </li>
                            </ol>
                        </li>
                        <li className='tariff-agreement_item'>ПОРЯДОК НАЧИСЛЕНИЯ И ВЫПЛАТЫ ПРОЦЕНТОВ НА БАЛАНС ИНВЕСТКОШЕЛЬКА. ДЕЙСТВИЕ УСЛОВИЙ
                            <ol>
                                <li>Проценты на сумму Баланса в течение срока, указанного в п. 6.4. Договора, начисляются исходя из ставки, указанной в п. 6.6. Настоящих Условий. В случае отсутствия в течение текущего срока совершения расходных операций до суммы неснижаемого остатка, установленного п.6.12 проценты аккумулируется на Балансе Инвесткошелька. Текущим сроком является соответствующий период времени со дня следующего за днем поступления токенов UBR на Баланс по день выплаты процентов включительно или со дня следующего за днем выплаты процентов до дня следующей выплаты процентов. Если Условиями предусмотрено продление Договора на очередной срок  программы «Average», проценты при очередном сроке начисляются исходя из ставки, действующей у Получателя для данного вида программы на дату продления  Условий Договора. Проценты на сумму Баланса  начисляются  на начало операционного дня со дня, следующего за днем поступления токенов UBR на  Баланс, до дня возврата Пользователю либо списания токенов UBR со счета Баланса по иным основаниям включительно. При расчете процентов учитывается количество календарных дней в году. Установленная процентная ставка в течение срока действия программы «Average» не может быть уменьшена Получателем в одностороннем порядке. Если последний день срока программы «Average» приходится на нерабочий день, днем окончания срока считается ближайший следующий за ним рабочий день. </li>
                                <li>Выплата начисленных на Баланс процентов производится в сроки, установленные п. 6.7. Условий. Отсчет сроков выплаты процентов ведется со дня, следующего за днем внесения токенов UBR на Баланс.</li>
                                <li>Невостребованные по истечению срока   проценты увеличивают сумму Баланса.</li>
                                <li>Если иное не установлено Условиями, то в случае невостребования Пользователем Баланса по истечении его срока, Договор в соответствии с п. 6.11. продлевается на очередной срок, равный сроку предыдущей программы. Очередной срок программы  исчисляется со дня, следующего за днем окончания предыдущего срока программы «Average». Количество продлений  на очередной срок Баланса определяется пунктом 6.11. Условий. Проценты по программе при продлении Условий хранения на очередной срок начисляются по ставке, действующей у Получателя для данного вида  программы на дату продления Условий хранения. Если п. 6.11. Договора не предусмотрено условие о том, что в случае невостребования Пользователем Баланса по истечении его срока Условия хранения  продлевается на очередной срок, то по истечении срока действия программы «Average» токены хранятся на Балансе до востребования Пользователем.</li>
                                <li>Досрочное расторжение Условий хранения не предусмотренно Настоящими Условиями.</li>
                            </ol>
                        </li>
                        <li className='tariff-agreement_item'>ОТВЕТСТВЕННОСТЬ СТОРОН. ПОРЯДОК РАЗРЕШЕНИЯ СПОРОВ
                            <ol>
                                <li>За неисполнение или ненадлежащее исполнение Настоящих Условий Стороны несут ответственность в соответствии с действующим законодательством государство Украина.</li>
                                <li>Споры по Настоящим Условиям разрешаются в претензионном порядке, а при недостижении согласия - в суде по месту нахождения ответчика в соответствии с действующим законодательством страны нахождения.</li>
                                <li>Во всем, что прямо не предусмотрено Настоящими Условиями, Стороны руководствуются действующим законодательством государства Украина.</li>
                            </ol>
                        </li>
                        <li className='tariff-agreement_item'>УСЛОВИЯ ПРОГРАММЫ «AVERAGE», ПРИМЕНЯЕМЫЕ К БАЛАНСУ В ОТДЕЛЬНЫХ СЛУЧАЯХ:
                            <ol>
                                <li>В случае внесения на Баланс токенов UBR  Пользователем на имя третьего лица, третье лицо  приобретает права Пользователя по Настоящим Условиям с момента предъявления им к Получателю  первого требования, основанного на этих правах, либо выражения им Получателю иным способом намерения воспользоваться такими правами (одновременно лицо пополнившее Баланс подписывает нотариальную доверенность на нового Пользователя). При внесении токенов UBR на Баланс Инвесткошелька  Пользователь тем самым подтверждает точность указанных данных  о фамилии, имени, отчестве и их соответствии документу, удостоверяющему личность Пользователя личного личного кабинета «Uroboros Platforms».</li>
                                <li>Получатель не исчисляет, не удерживает и не  перечисляет в бюджет налог на доходы физических лиц в соответствии с действующим законодательством. Налог на доходы физических лиц исчисляется с суммы процентного дохода по Балансу в переводе к местной валюте(UAH) а Пользователь оплачивает их самостоятельно исходя из ставки рефинансирования ЦБ Украины.Пользователь оплачивает исчисленную сумму налога непосредственно из доходов налогоплательщика при их фактической выплате с Баланса Инвесткошелька и конвертации токенов UBR в местную валюту.</li>
                            </ol>
                        </li>
                        <li className='tariff-agreement_item'>ОСНОВНЫЕ УСЛОВИЯ ПРОГРАММЫ «AVERAGE»:
                            <ol>
                                <li>Наименование программы «Average»</li>
                                <li>Сумма и валюта Вклада   от   6   до   15   токенов   UBR</li>
                                <li>Срок Вклада (дней) 90</li>
                                <li>Дата окончания срока действия программы 91ый день</li>
                                <li>Процентная ставка по программе на Баланс Инвесткошелька 0.25% в день</li>
                                <li>Выплата начисленных процентов ежедневно </li>
                                <li>Дополнительное пополнение Баланса в программе: не предусмотренно(не исключает открытие аналогичной программы)</li>
                                <li>Досрочное расторжение не предусмотренно</li>
                                <li>Kоличество продлений программы на очередной срок : не ограниченно</li>
                                <li>Сумма неснижаемого остатка равна сумме первоначального Баланса при открытии программы и равна от 6 до 15токенов UBR</li>
                            </ol>
                        </li>
                    </ol>
                    <div className='tariff-agreement_block'>
                        <p> Подтверждением и принятием Настоящих Условий служит пополнение Баланса Инвесткошелька по одной из программ предоставляемых Получателем («Uroboros Platforms») </p>
                        <p> В соответствии с Требованиями  Закона "О персональных данных", принятием Настоящих Условий даю свое согласие "Uroboros Platforms"  на обработку моих персональных данных, указанных при регистрации на сайте, включая сбор, систематизацию накопление, хранение, уточнение (обновление, изменение), использование, распространение (в том числе передачу), обезличивание, блокирование.</p>
                    </div>
                </div>
            </Content>
        </section>
    );
}

export default AverageAgreement;
